{
  "basics": {
    "name": "Jesse McCann",
    "label": "Site Reliability Engineer",
    "image": "",
    "email": "jesse@mccannical.com",
    "phone": "(818( 403-8142",
    "url": "https://mccannical.github.io/resume/",
    "summary": "Accomplished Senior Systems Engineer with over 16 years of success in driving cloud infrastructure and system reliability across diverse organizations. Track record of spearheading system maturity, ensuring compliance with industry standards, and implementing robust security measures. Instrumental in designing and implementing robust and scalable infrastructure architectures that meet the organization's needs by evaluating requirements, selecting appropriate technologies, and creating design plans. Adept at cross-functional collaboration, continuous learning initiatives, and implementing best practices to optimize cloud networking, infrastructure, and expenditure. Proven ability to monitor system performance, identify bottlenecks, and optimize resources to ensure high availability and reliability. Exceptional leadership capabilities in orchestrating strategic migrations, enhancing operational efficiency, and empowering teams with novel technologies. Passionate about leveraging technology for societal good and advancing corporate goals through innovative solutions.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Philadelphia",
      "countryCode": "US",
      "region": "Pennsylvania"
    },
    "profiles": [
      {
        "network": "Bluesky",
        "username": "mccannical.bsky.social",
        "url": "https://bsky.app/profile/mccannical.bsky.social"
      },
      {
        "network": "LinkedIn",
        "username": "jessemccann",
        "url": "https://www.linkedin.com/in/jessemccann/"
      }
    ]
  },
  "work": [
    {
      "company": "DTEX Systems",
      "location": "Saratoga, CA (REMOTE)",
      "description": "The Trusted Leader in Insider Risk Management",
      "position": "Site Reliability Engineer",
      "website": "https://www.dtexsystems.com/",
      "startDate": "2024-05",
      "endDate": "",
      "summary": "Joined small team to design and build FedRAMP compliant environment from greenfield, ATO, and Acceptance. ",
      "highlights": [
        "Reduced time to deploy a customer from 1d to 1h",
        "Developed internal tools to reduce friction interacting with customer environments",
        "Led development of automation of customer environments"
      ]
    },
    {
      "company": "Confluent",
      "location": "Mountain View, CA (REMOTE)",
      "description": "The Data Streaming Platform. Kafka + Flink",
      "position": "Senior Cloud Systems Engineer",
      "website": "https://www.confluent.io/",
      "startDate": "2020-11",
      "endDate": "2024-04",
      "summary": "Spearhead system maturity throughout Confluent's pre-IPO, IPO, and post-IPO phases, driving continuous learning initiatives among engineering teams. Collaborate cross-functionally to ensure project success in Security, Infrastructure, and CI/CD domains, prioritizing holistic reliability. Establish and enforce best practices for system security, mitigating risks and ensuring compliance with industry standards. Develop a monitoring system on Google Cloud Platform (GCP) for real-time performance visibility, facilitating proactive issue resolution and optimization efforts.\n",
      "highlights": [
        "Enhanced security and reliability of cloud infrastructure for Kubernetes and serverless environments, reducing vulnerabilities by 85%",
        "Automated manual processes by developing serverless backend services, enhancing operational efficiency and scalability",
        "Optimized cloud networking, infrastructure, and expenditure by leveraging DevOps methodologies, resulting in enhanced efficiency and cost savings",
        "Streamlined deployment processes using Terraform and Atlantis, achieving a 90% reduction in deployment time and enhancing operational agility",
        "Implemented robust CI/CD pipelines to enable rapid and reliable application deployment, contributing to improved development velocity."
      ]
    },
    {
      "company": "Blackline",
      "location": "Woodland Hills, CA (REMOTE)",
      "description": "Standardize, control, and automate account reconciliation processes in minutes.",
      "position": "Staff System Engineer",
      "website": "https://www.blackline.com/",
      "startDate": "2018-02",
      "endDate": "2020-11",
      "summary": "Directed the migration of legacy infrastructure to Google Cloud Platform (GCP) using Terraform, optimizing reliability and scalability. Managed the Atlassian Stack to ensure high availability of essential tools, facilitating seamless collaboration and workflow management. Integrated SAP Resolve with Salesforce to streamline operations and improve efficiency in data management and resolution processes.  Established a version control system for cloud infrastructure using GitLab, ensuring reliability and version consistency across environments. Provided comprehensive training on Git, PowerShell, Python, Terraform, and cloud technologies to facilitate skill development and knowledge sharing within the team.\n",
      "highlights": [
        "Designed scalable and reliable cloud platforms, driving cost savings and operational efficiency across the organization",
        "Automated HRIS updates to enhance employee management processes, increasing efficiency/accuracy in HR operations",
        "Implemented automated Linux server configuration leveraging GitLab CI/CD, significantly improving deployment efficiency and reducing manual errors",
        "Automated server deployment and patch management processes, optimizing system stability and reducing downtime",
        "Streamlined tool upgrades through GitLab CI/CD integration, minimizing disruptions and maximizing productivity",
        "Led DevOps initiatives, empowering teams with CI/CD and GitOps methodologies to boost development velocity and operational efficiency."
      ]
    },
    {
      "company": "Applied Minds",
      "location": "Glendale, CA",
      "description": "Delivering innovation through technology, design and engineering",
      "position": "Senior Systems Engineer",
      "website": "https://www.appliedminds.com/",
      "startDate": "2018-02",
      "endDate": "2014-11",
      "summary": "Spearheaded the organization's journey to NIST-171 compliance by implementing robust security controls, ensuring adherence to industry standards and best practices. Developed real-time monitoring capabilities using the ELK stack on Azure, enabling proactive identification and resolution of system issues. Engineered robust backup and disaster recovery mechanisms with Azure, ensuring data integrity and business continuity in the event of unforeseen circumstances. Maintained comprehensive system documentation to ensure transparency and facilitate knowledge sharing among team members. Configured and maintained firewall, network, and cloud security measures to safeguard organizational assets and data integrity. Collaborated closely with engineering and software development teams, providing expertise and guidance on project initiatives to ensure alignment with organizational objectives.\n",
      "highlights": [
        "Successfully orchestrated the migration of internal applications to Amazon Web Services (AWS) within established timelines and budgetary constraints, ensuring seamless transition and minimal disruption to operations. Maintained an uptime of 99.99% for all internal services, ensuring uninterrupted access and reliability for end-users.",
        "Led the migration of Exchange to Office 365, using cloud-based solutions for improved collaboration and productivity.",
        "Obtained Secret clearance, demonstrating trustworthiness and commitment to security protocols.",
        "Designed secure cloud-based architectures for scalability and resilience, leveraging best practices to mitigate risks and enhance operational agility.",
        "Optimized system performance through strategic upgrades to network and server infrastructure, enhancing overall efficiency and responsiveness.",
        "Implemented Azure and AWS solutions to enhance scalability and reduce costs associated with legacy hardware, optimizing resource utilization and efficiency."
      ]
    },
    {
      "company": "Virgin Galactic",
      "location": "Mojave, CA",
      "description": "The Spaceline for Earth.",
      "position": "Senior Systems Engineer",
      "website": "https://www.virgingalactic.com/",
      "startDate": "2012-06",
      "endDate": "2012-11",
      "summary": "Configured and maintained high-availability clusters for critical services, ensuring seamless access and reliability for users. Developed and implemented installation scripts to streamline deployment processes, improving operational efficiency. Implemented robust firewalls and intrusion detection systems to bolster network security and mitigate cyber threats. Monitored system performance and resource utilization, proactively identifying and resolving potential bottlenecks and issues. Conducted regular upgrades and maintenance activities to enhance system stability and efficiency. Implemented backup and disaster recovery strategies to safeguard critical data and ensure business continuity in adverse scenarios. \n",
      "highlights": [
        "Recognized for exceptional performance, advanced from System Administrator to higher roles within the organization",
        "Led storage migration initiatives to SANs and PowerVaults, establishing data redundancy and improving storage efficiency",
        "Streamlined access management by integrating Linux servers with Active Directory, optimizing user authentication processes",
        "Improved workflows by automating routine tasks with custom scripts, reducing manual intervention and errors",
        "Revamped VPNs, networks, and servers to enhance reliability/performance, ensuring seamless connectivity for users",
        "Designed fault-tolerant system architectures to accommodate diverse user requirements and ensure system resilience",
        "Achieved a 100% success rate in resolving complex technical issues",
        " Introduced cloud-based virtualization solutions, resulting in a 70% reduction in infrastructure costs while maximizing scalability and resource utilization",
        "Spearheaded system security efforts by conducting vulnerability scans and deploying patches, bolstering defenses against potential threats",
        "Enhanced Group Policy Objects (GPO), Active Directory (AD), and security protocols to fortify system integrity and data protection measures."
      ]
    }
  ],
  "volunteer": [],
  "education": [],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Infrastructure",
      "keywords": ["Terraform/OpenTofu", "Ansible", "GCP", "AWS", "OnPrem"]
    },
    {
      "name": "Software Engineering",
      "keywords": ["Go", "Python", "Bash", "Node.js", "Powershell"]
    }
  ],
  "languages": [],
  "interests": [
    {
      "name": "Wildlife",
      "keywords": ["Conservation", "Tracking"]
    },
    {
      "name": "Guitar",
      "keywords": ["Punk", "Hardcore", "Metal"]
    },
    {
      "name": "Horror Movies",
      "keywords": [""]
    }
  ],
  "references": [],
  "projects": [],
  "meta": {
    "canonical": "",
    "version": "",
    "lastModified": ""
  }
}
